#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 1d0f869afdfce793231e7249298ad4e7.pdb
; shader hash: 1d0f869afdfce793231e7249298ad4e7
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.SceneConstantBuffer
;       {
;
;           row_major float4x4 projectionToWorld;     ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;           float reflectance;                        ; Offset:  128
;           float elapsedTime;                        ; Offset:  132
;           int debugFlag;                            ; Offset:  136
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   140
;
; }
;
; cbuffer l_materialCB
; {
;
;   struct l_materialCB
;   {
;
;       struct struct.PrimitiveConstantBuffer
;       {
;
;           float4 albedo;                            ; Offset:    0
;           float reflectanceCoef;                    ; Offset:   16
;           float diffuseCoef;                        ; Offset:   20
;           float specularCoef;                       ; Offset:   24

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !27, subprograms: !88, globals: !467)
!1 = !DIFile(filename: "Raytracing.hlsl", directory: "")
!2 = !{!3, !11, !17, !21}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 96, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "./engine/ShaderCompat.h", directory: "")
!5 = !DINamespace(name: "SignedDistancePrimitive", scope: null, file: !4, line: 95)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "JuliaSets", value: 0)
!8 = !DIEnumerator(name: "IntersectedRoundCube", value: 1)
!9 = !DIEnumerator(name: "Mandelbulb", value: 2)
!10 = !DIEnumerator(name: "Count", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !12, file: !4, line: 81, size: 32, align: 32, elements: !13)
!12 = !DINamespace(name: "AnalyticPrimitive", scope: null, file: !4, line: 80)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "Spheres", value: 0)
!15 = !DIEnumerator(name: "AABB", value: 1)
!16 = !DIEnumerator(name: "Count", value: 0)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !18, file: !4, line: 89, size: 32, align: 32, elements: !19)
!18 = !DINamespace(name: "VolumetricPrimitive", scope: null, file: !4, line: 88)
!19 = !{!20, !16}
!20 = !DIEnumerator(name: "Metaballs", value: 0)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !22, file: !4, line: 47, size: 32, align: 32, elements: !23)
!22 = !DINamespace(name: "RayType", scope: null, file: !4, line: 46)
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "Radiance", value: 0)
!25 = !DIEnumerator(name: "Shadow", value: 1)
!26 = !DIEnumerator(name: "Count", value: 2)
!27 = !{!28, !38, !48, !58, !42, !64, !73, !3}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 151, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 151, size: 64, align: 32, elements: !30, templateParams: !34)
!30 = !{!31, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 151, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 151, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !{!35, !36}
!35 = !DITemplateTypeParameter(name: "element", type: !32)
!36 = !DITemplateValueParameter(name: "element_count", type: !37, value: i32 2)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 28, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 28, size: 96, align: 32, elements: !40, templateParams: !45)
!40 = !{!41, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 28, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 28, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 28, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!46, !47}
!46 = !DITemplateTypeParameter(name: "element", type: !42)
!47 = !DITemplateValueParameter(name: "element_count", type: !37, value: i32 3)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x2", file: !1, line: 112, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 2>", file: !1, line: 112, size: 128, align: 32, elements: !50, templateParams: !55)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 112, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 112, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 112, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 112, baseType: !42, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !{!46, !56, !57}
!56 = !DITemplateValueParameter(name: "row_count", type: !37, value: i32 2)
!57 = !DITemplateValueParameter(name: "col_count", type: !37, value: i32 2)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !60, templateParams: !63)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !59, file: !1, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !59, file: !1, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!63 = !{!46, !36}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 61, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 61, size: 128, align: 32, elements: !66, templateParams: !71)
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !65, file: !1, line: 61, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !65, file: !1, line: 61, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !65, file: !1, line: 61, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !65, file: !1, line: 61, baseType: !42, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !{!46, !72}
!72 = !DITemplateValueParameter(name: "element_count", type: !37, value: i32 4)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 204, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 204, size: 288, align: 32, elements: !75, templateParams: !85)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !74, file: !1, line: 204, baseType: !42, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!85 = !{!46, !86, !87}
!86 = !DITemplateValueParameter(name: "row_count", type: !37, value: i32 3)
!87 = !DITemplateValueParameter(name: "col_count", type: !37, value: i32 3)
!88 = !{!89, !93, !96, !99, !104, !108, !111, !117, !124, !127, !130, !157, !160, !163, !167, !170, !173, !185, !186, !189, !195, !198, !206, !212, !215, !219, !224, !227, !229, !230, !231, !234, !237, !238, !239, !240, !243, !244, !247, !250, !251, !254, !257, !258, !261, !262, !263, !264, !265, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !281, !284, !287, !290, !292, !296, !299, !302, !306, !309, !310, !311, !314, !317, !318, !319, !320, !321, !322, !329, !332, !335, !336, !337, !340, !341, !342, !345, !346, !351, !353, !356, !359, !362, !365, !368, !371, !383, !384, !392, !394, !397, !401, !404, !405, !408, !411, !414, !417, !420, !423, !426, !429, !430, !431, !437, !440, !443, !444, !445, !452, !455}
!89 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$01@@@Z", scope: !90, file: !90, line: 25, type: !91, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DIFile(filename: "./RaytracingShaderHelper.hlsli", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!42, !58}
!93 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$02@@@Z", scope: !90, file: !90, line: 30, type: !94, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!42, !38}
!96 = !DISubprogram(name: "CalculateAnimationInterpolant", linkageName: "\01?CalculateAnimationInterpolant@@YAMMM@Z", scope: !90, file: !90, line: 36, type: !97, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!42, !42, !42}
!99 = !DISubprogram(name: "swap", linkageName: "\01?swap@@YAXAIAM0@Z", scope: !90, file: !90, line: 43, type: !100, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !102, !102}
!102 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !42)
!104 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NMMM@Z", scope: !90, file: !90, line: 50, type: !105, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !42, !42, !42}
!107 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!108 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !90, file: !90, line: 89, type: !109, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!38}
!111 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@V?$vector@M$01@@@Z", scope: !90, file: !90, line: 95, type: !112, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubroutineType(types: !113)
!113 = !{!38, !114, !58}
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 288, align: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 3)
!117 = !DISubprogram(name: "IsCulled", linkageName: "\01?IsCulled@@YA_NURay@@V?$vector@M$02@@@Z", scope: !90, file: !90, line: 123, type: !118, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false)
!118 = !DISubroutineType(types: !119)
!119 = !{!107, !120, !38}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !90, line: 19, size: 192, align: 32, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !120, file: !90, line: 21, baseType: !38, size: 96, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !120, file: !90, line: 22, baseType: !38, size: 96, align: 32, offset: 96)
!124 = !DISubprogram(name: "IsAValidHit", linkageName: "\01?IsAValidHit@@YA_NURay@@MV?$vector@M$02@@@Z", scope: !90, file: !90, line: 136, type: !125, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{!107, !120, !42, !38}
!127 = !DISubprogram(name: "TexCoords", linkageName: "\01?TexCoords@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !90, file: !90, line: 142, type: !128, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!128 = !DISubroutineType(types: !129)
!129 = !{!58, !38}
!130 = !DISubprogram(name: "CalculateRayDifferentials", linkageName: "\01?CalculateRayDifferentials@@YAXAIAV?$vector@M$01@@0V1@V?$vector@M$02@@22V?$matrix@M$03$03@@@Z", scope: !90, file: !90, line: 148, type: !131, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !133, !58, !38, !38, !38, !135}
!133 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !58)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 145, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 145, size: 512, align: 32, elements: !137, templateParams: !154)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !136, file: !1, line: 145, baseType: !42, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!154 = !{!46, !155, !156}
!155 = !DITemplateValueParameter(name: "row_count", type: !37, value: i32 4)
!156 = !DITemplateValueParameter(name: "col_count", type: !37, value: i32 4)
!157 = !DISubprogram(name: "AnalyticalCheckersTexture", linkageName: "\01?AnalyticalCheckersTexture@@YAMV?$vector@M$02@@00V?$matrix@M$03$03@@@Z", scope: !90, file: !90, line: 167, type: !158, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!158 = !DISubroutineType(types: !159)
!159 = !{!42, !38, !38, !38, !135}
!160 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !90, file: !90, line: 178, type: !161, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!161 = !DISubroutineType(types: !162)
!162 = !{!38, !38, !38, !38}
!163 = !DISubprogram(name: "SolveQuadraticEqn", linkageName: "\01?SolveQuadraticEqn@@YA_NMMMAIAM0@Z", scope: !164, file: !164, line: 28, type: !165, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!164 = !DIFile(filename: "./AnalyticPrimitives.hlsli", directory: "")
!165 = !DISubroutineType(types: !166)
!166 = !{!107, !42, !42, !42, !102, !102}
!167 = !DISubprogram(name: "CalculateNormalForARaySphereHit", linkageName: "\01?CalculateNormalForARaySphereHit@@YA?AV?$vector@M$02@@URay@@MV1@@Z", scope: !164, file: !164, line: 46, type: !168, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!168 = !DISubroutineType(types: !169)
!169 = !{!38, !120, !42, !38}
!170 = !DISubprogram(name: "SolveRaySphereIntersectionEquation", linkageName: "\01?SolveRaySphereIntersectionEquation@@YA_NURay@@AIAM1V?$vector@M$02@@M@Z", scope: !164, file: !164, line: 54, type: !171, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!171 = !DISubroutineType(types: !172)
!172 = !{!107, !120, !102, !102, !38, !42}
!173 = !DISubprogram(name: "RaySphereIntersectionTest", linkageName: "\01?RaySphereIntersectionTest@@YA_NURay@@AIAM1UProceduralPrimitiveAttributes@@V?$vector@M$02@@M@Z", scope: !164, file: !164, line: 64, type: !174, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !120, !102, !102, !176, !38, !42}
!176 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProceduralPrimitiveAttributes", file: !178, line: 13, size: 224, align: 32, elements: !179)
!178 = !DIFile(filename: "./engine/AttribStructs.h", directory: "")
!179 = !{!180, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !177, file: !178, line: 15, baseType: !181, size: 96, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !182, line: 16, baseType: !38)
!182 = !DIFile(filename: "./engine/..\5Cutil\5CHlslCompat.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !177, file: !178, line: 16, baseType: !184, size: 128, align: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !182, line: 17, baseType: !64)
!185 = !DISubprogram(name: "RaySolidSphereIntersectionTest", linkageName: "\01?RaySolidSphereIntersectionTest@@YA_NURay@@AIAM1V?$vector@M$02@@M@Z", scope: !164, file: !164, line: 104, type: !171, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false)
!186 = !DISubprogram(name: "RaySpheresIntersectionTest", linkageName: "\01?RaySpheresIntersectionTest@@YA_NURay@@AIAMUProceduralPrimitiveAttributes@@@Z", scope: !164, file: !164, line: 119, type: !187, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DISubroutineType(types: !188)
!188 = !{!107, !120, !102, !176}
!189 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NURay@@Y01V?$vector@M$02@@AIAM2@Z", scope: !164, file: !164, line: 159, type: !190, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false)
!190 = !DISubroutineType(types: !191)
!191 = !{!107, !120, !192, !102, !102}
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, align: 32, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 2)
!195 = !DISubprogram(name: "RayAABBIntersectionTest", linkageName: "\01?RayAABBIntersectionTest@@YA_NURay@@Y01V?$vector@M$02@@AIAMUProceduralPrimitiveAttributes@@@Z", scope: !164, file: !164, line: 194, type: !196, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false)
!196 = !DISubroutineType(types: !197)
!197 = !{!107, !120, !192, !102, !176}
!198 = !DISubprogram(name: "CalculateMetaballPotential", linkageName: "\01?CalculateMetaballPotential@@YAMV?$vector@M$02@@UMetaball@@AIAM@Z", scope: !199, file: !199, line: 36, type: !200, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!199 = !DIFile(filename: "./VolumetricPrimitives.hlsli", directory: "")
!200 = !DISubroutineType(types: !201)
!201 = !{!42, !38, !202, !102}
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Metaball", file: !199, line: 27, size: 128, align: 32, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !202, file: !199, line: 29, baseType: !38, size: 96, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !202, file: !199, line: 30, baseType: !42, size: 32, align: 32, offset: 96)
!206 = !DISubprogram(name: "CalculateMetaballsPotential", linkageName: "\01?CalculateMetaballsPotential@@YAMV?$vector@M$02@@Y02UMetaball@@I@Z", scope: !199, file: !199, line: 60, type: !207, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!207 = !DISubroutineType(types: !208)
!208 = !{!42, !38, !209, !210}
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 384, align: 32, elements: !115)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !182, line: 20, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 57, baseType: !32)
!212 = !DISubprogram(name: "CalculateMetaballsNormal", linkageName: "\01?CalculateMetaballsNormal@@YA?AV?$vector@M$02@@V1@Y02UMetaball@@I@Z", scope: !199, file: !199, line: 76, type: !213, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!213 = !DISubroutineType(types: !214)
!214 = !{!38, !38, !209, !210}
!215 = !DISubprogram(name: "InitializeAnimatedMetaballs", linkageName: "\01?InitializeAnimatedMetaballs@@YAXY02$$CAUMetaball@@MM@Z", scope: !199, file: !199, line: 88, type: !216, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !218, !42, !42}
!218 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !209)
!219 = !DISubprogram(name: "FindIntersectingMetaballs", linkageName: "\01?FindIntersectingMetaballs@@YAXURay@@AIAM1Y02$$CAUMetaball@@AIAI@Z", scope: !199, file: !199, line: 148, type: !220, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !120, !102, !102, !218, !222}
!222 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !210)
!224 = !DISubprogram(name: "RayMetaballsIntersectionTest", linkageName: "\01?RayMetaballsIntersectionTest@@YA_NURay@@AIAMUProceduralPrimitiveAttributes@@M@Z", scope: !199, file: !199, line: 175, type: !225, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false)
!225 = !DISubroutineType(types: !226)
!226 = !{!107, !120, !102, !176, !42}
!227 = !DISubprogram(name: "opS", linkageName: "\01?opS@@YAMMM@Z", scope: !228, file: !228, line: 55, type: !97, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!228 = !DIFile(filename: "./SignedDistancePrimitives.hlsli", directory: "")
!229 = !DISubprogram(name: "opU", linkageName: "\01?opU@@YAMMM@Z", scope: !228, file: !228, line: 61, type: !97, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false)
!230 = !DISubprogram(name: "opI", linkageName: "\01?opI@@YAMMM@Z", scope: !228, file: !228, line: 67, type: !97, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!231 = !DISubprogram(name: "opRep", linkageName: "\01?opRep@@YA?AV?$vector@M$02@@V1@0@Z", scope: !228, file: !228, line: 73, type: !232, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!232 = !DISubroutineType(types: !233)
!233 = !{!38, !38, !38}
!234 = !DISubprogram(name: "smin", linkageName: "\01?smin@@YAMMMM@Z", scope: !228, file: !228, line: 80, type: !235, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!235 = !DISubroutineType(types: !236)
!236 = !{!42, !42, !42, !42}
!237 = !DISubprogram(name: "smax", linkageName: "\01?smax@@YAMMMM@Z", scope: !228, file: !228, line: 88, type: !235, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!238 = !DISubprogram(name: "opBlendU", linkageName: "\01?opBlendU@@YAMMM@Z", scope: !228, file: !228, line: 95, type: !97, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!239 = !DISubprogram(name: "opBlendI", linkageName: "\01?opBlendI@@YAMMM@Z", scope: !228, file: !228, line: 101, type: !97, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DISubprogram(name: "opTwist", linkageName: "\01?opTwist@@YA?AV?$vector@M$02@@V1@@Z", scope: !228, file: !228, line: 108, type: !241, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!241 = !DISubroutineType(types: !242)
!242 = !{!38, !38}
!243 = !DISubprogram(name: "sdPlane", linkageName: "\01?sdPlane@@YAMV?$vector@M$02@@@Z", scope: !228, file: !228, line: 119, type: !94, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!244 = !DISubprogram(name: "sdSphere", linkageName: "\01?sdSphere@@YAMV?$vector@M$02@@M@Z", scope: !228, file: !228, line: 124, type: !245, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!245 = !DISubroutineType(types: !246)
!246 = !{!42, !38, !42}
!247 = !DISubprogram(name: "sdBox", linkageName: "\01?sdBox@@YAMV?$vector@M$02@@0@Z", scope: !228, file: !228, line: 130, type: !248, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!248 = !DISubroutineType(types: !249)
!249 = !{!42, !38, !38}
!250 = !DISubprogram(name: "sdEllipsoid", linkageName: "\01?sdEllipsoid@@YAMV?$vector@M$02@@0@Z", scope: !228, file: !228, line: 136, type: !248, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!251 = !DISubprogram(name: "udRoundBox", linkageName: "\01?udRoundBox@@YAMV?$vector@M$02@@0M@Z", scope: !228, file: !228, line: 141, type: !252, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false)
!252 = !DISubroutineType(types: !253)
!253 = !{!42, !38, !38, !42}
!254 = !DISubprogram(name: "sdTorus", linkageName: "\01?sdTorus@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 147, type: !255, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false)
!255 = !DISubroutineType(types: !256)
!256 = !{!42, !38, !58}
!257 = !DISubprogram(name: "sdHexPrism", linkageName: "\01?sdHexPrism@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 153, type: !255, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false)
!258 = !DISubprogram(name: "sdCapsule", linkageName: "\01?sdCapsule@@YAMV?$vector@M$02@@00M@Z", scope: !228, file: !228, line: 161, type: !259, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false)
!259 = !DISubroutineType(types: !260)
!260 = !{!42, !38, !38, !38, !42}
!261 = !DISubprogram(name: "sdEquilateralTriangle", linkageName: "\01?sdEquilateralTriangle@@YAMV?$vector@M$01@@@Z", scope: !228, file: !228, line: 168, type: !91, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false)
!262 = !DISubprogram(name: "sdTriPrism", linkageName: "\01?sdTriPrism@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 178, type: !255, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!263 = !DISubprogram(name: "sdCylinder", linkageName: "\01?sdCylinder@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 193, type: !255, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false)
!264 = !DISubprogram(name: "sdCone", linkageName: "\01?sdCone@@YAMV?$vector@M$02@@0@Z", scope: !228, file: !228, line: 199, type: !248, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false)
!265 = !DISubprogram(name: "sdConeSection", linkageName: "\01?sdConeSection@@YAMV?$vector@M$02@@MMM@Z", scope: !228, file: !228, line: 207, type: !266, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false)
!266 = !DISubroutineType(types: !267)
!267 = !{!42, !38, !42, !42, !42}
!268 = !DISubprogram(name: "sdOctahedron", linkageName: "\01?sdOctahedron@@YAMV?$vector@M$02@@0@Z", scope: !228, file: !228, line: 220, type: !248, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!269 = !DISubprogram(name: "sdPyramid", linkageName: "\01?sdPyramid@@YAMV?$vector@M$02@@0@Z", scope: !228, file: !228, line: 236, type: !248, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false)
!270 = !DISubprogram(name: "length_toPowNegative6", linkageName: "\01?length_toPowNegative6@@YAMV?$vector@M$01@@@Z", scope: !228, file: !228, line: 245, type: !91, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false)
!271 = !DISubprogram(name: "length_toPowNegative8", linkageName: "\01?length_toPowNegative8@@YAMV?$vector@M$01@@@Z", scope: !228, file: !228, line: 252, type: !91, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DISubprogram(name: "sdTorus82", linkageName: "\01?sdTorus82@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 258, type: !255, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false)
!273 = !DISubprogram(name: "sdTorus88", linkageName: "\01?sdTorus88@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 264, type: !255, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false)
!274 = !DISubprogram(name: "sdCylinder6", linkageName: "\01?sdCylinder6@@YAMV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !228, file: !228, line: 270, type: !255, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false)
!275 = !DISubprogram(name: "mobiusStrip", linkageName: "\01?mobiusStrip@@YAMV?$vector@M$02@@@Z", scope: !228, file: !228, line: 276, type: !94, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false)
!276 = !DISubprogram(name: "torusVisgraf", linkageName: "\01?torusVisgraf@@YAMV?$vector@M$02@@@Z", scope: !228, file: !228, line: 302, type: !94, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: false)
!277 = !DISubprogram(name: "pacMan", linkageName: "\01?pacMan@@YAMV?$vector@M$02@@M@Z", scope: !228, file: !228, line: 313, type: !245, isLocal: false, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false)
!278 = !DISubprogram(name: "isphere", linkageName: "\01?isphere@@YA?AV?$vector@M$01@@V?$vector@M$03@@V?$vector@M$02@@1@Z", scope: !228, file: !228, line: 327, type: !279, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false)
!279 = !DISubroutineType(types: !280)
!280 = !{!58, !64, !38, !38}
!281 = !DISubprogram(name: "sdCalculateNormal", linkageName: "\01?sdCalculateNormal@@YA?AV?$vector@M$02@@V1@W4Enum@SignedDistancePrimitive@@M@Z", scope: !228, file: !228, line: 343, type: !282, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false)
!282 = !DISubroutineType(types: !283)
!283 = !{!38, !38, !3, !42}
!284 = !DISubprogram(name: "RaySignedDistancePrimitiveTest", linkageName: "\01?RaySignedDistancePrimitiveTest@@YA_NURay@@W4Enum@SignedDistancePrimitive@@AIAMUProceduralPrimitiveAttributes@@MM@Z", scope: !228, file: !228, line: 355, type: !285, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: false)
!285 = !DISubroutineType(types: !286)
!286 = !{!107, !120, !3, !102, !176, !42, !42}
!287 = !DISubprogram(name: "CheckersTextureBoxFilter", linkageName: "\01?CheckersTextureBoxFilter@@YAMV?$vector@M$01@@00I@Z", scope: !228, file: !228, line: 402, type: !288, isLocal: false, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: false)
!288 = !DISubroutineType(types: !289)
!289 = !{!42, !58, !58, !58, !210}
!290 = !DISubprogram(name: "sdFractalPyramid", linkageName: "\01?sdFractalPyramid@@YAMV?$vector@M$02@@0M@Z", scope: !291, file: !291, line: 34, type: !252, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!291 = !DIFile(filename: "./SignedDistanceFractals.hlsli", directory: "")
!292 = !DISubprogram(name: "RayAnalyticGeometryIntersectionTest", linkageName: "\01?RayAnalyticGeometryIntersectionTest@@YA_NURay@@W4Enum@AnalyticPrimitive@@AIAMUProceduralPrimitiveAttributes@@@Z", scope: !293, file: !293, line: 32, type: !294, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!293 = !DIFile(filename: "./ProceduralPrimitivesLibrary.hlsli", directory: "")
!294 = !DISubroutineType(types: !295)
!295 = !{!107, !120, !11, !102, !176}
!296 = !DISubprogram(name: "RayVolumetricGeometryIntersectionTest", linkageName: "\01?RayVolumetricGeometryIntersectionTest@@YA_NURay@@W4Enum@VolumetricPrimitive@@AIAMUProceduralPrimitiveAttributes@@M@Z", scope: !293, file: !293, line: 50, type: !297, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!297 = !DISubroutineType(types: !298)
!298 = !{!107, !120, !17, !102, !176, !42}
!299 = !DISubprogram(name: "GetDistanceFromSignedDistancePrimitive", linkageName: "\01?GetDistanceFromSignedDistancePrimitive@@YAMV?$vector@M$02@@W4Enum@SignedDistancePrimitive@@M@Z", scope: !293, file: !293, line: 63, type: !300, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!300 = !DISubroutineType(types: !301)
!301 = !{!42, !38, !3, !42}
!302 = !DISubprogram(name: "diff_Gaussian", linkageName: "\01?diff_Gaussian@@YAMV?$vector@M$02@@H0MM@Z", scope: !303, file: !303, line: 26, type: !304, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!303 = !DIFile(filename: "./Graph3D.hlsli", directory: "")
!304 = !DISubroutineType(types: !305)
!305 = !{!42, !38, !37, !38, !42, !42}
!306 = !DISubprogram(name: "diff_saddle", linkageName: "\01?diff_saddle@@YAMV?$vector@M$02@@H@Z", scope: !303, file: !303, line: 41, type: !307, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!307 = !DISubroutineType(types: !308)
!308 = !{!42, !38, !37}
!309 = !DISubprogram(name: "diff_saddle1", linkageName: "\01?diff_saddle1@@YAMV?$vector@M$02@@H@Z", scope: !303, file: !303, line: 68, type: !307, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DISubprogram(name: "diff_paraboloid", linkageName: "\01?diff_paraboloid@@YAMV?$vector@M$02@@H@Z", scope: !303, file: !303, line: 95, type: !307, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!311 = !DISubprogram(name: "diff_Gaussian", linkageName: "\01?diff_Gaussian@@YAMV?$vector@M$02@@HH0MM@Z", scope: !303, file: !303, line: 121, type: !312, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false)
!312 = !DISubroutineType(types: !313)
!313 = !{!42, !38, !37, !37, !38, !42, !42}
!314 = !DISubprogram(name: "diff_saddle", linkageName: "\01?diff_saddle@@YAMV?$vector@M$02@@HH@Z", scope: !303, file: !303, line: 141, type: !315, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false)
!315 = !DISubroutineType(types: !316)
!316 = !{!42, !38, !37, !37}
!317 = !DISubprogram(name: "diff_saddle1", linkageName: "\01?diff_saddle1@@YAMV?$vector@M$02@@HH@Z", scope: !303, file: !303, line: 174, type: !315, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false)
!318 = !DISubprogram(name: "diff_paraboloid", linkageName: "\01?diff_paraboloid@@YAMV?$vector@M$02@@HH@Z", scope: !303, file: !303, line: 196, type: !315, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubprogram(name: "diff", linkageName: "\01?diff@@YAMV?$vector@M$02@@H@Z", scope: !303, file: !303, line: 215, type: !307, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: false)
!320 = !DISubprogram(name: "diff", linkageName: "\01?diff@@YAMV?$vector@M$02@@HH@Z", scope: !303, file: !303, line: 230, type: !315, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false)
!321 = !DISubprogram(name: "grad", linkageName: "\01?grad@@YA?AV?$vector@M$02@@V1@@Z", scope: !303, file: !303, line: 247, type: !241, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false)
!322 = !DISubprogram(name: "sumGraphRay", linkageName: "\01?sumGraphRay@@YA?AUgraphRay@@U1@0@Z", scope: !303, file: !303, line: 258, type: !323, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !325, !325}
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "graphRay", file: !303, line: 14, size: 192, align: 32, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !325, file: !303, line: 16, baseType: !38, size: 96, align: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !325, file: !303, line: 17, baseType: !38, size: 96, align: 32, offset: 96)
!329 = !DISubprogram(name: "mulGraphRay", linkageName: "\01?mulGraphRay@@YA?AUgraphRay@@U1@M@Z", scope: !303, file: !303, line: 271, type: !330, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: false)
!330 = !DISubroutineType(types: !331)
!331 = !{!325, !325, !42}
!332 = !DISubprogram(name: "graphDot", linkageName: "\01?graphDot@@YAMV?$vector@M$02@@00@Z", scope: !303, file: !303, line: 284, type: !333, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false)
!333 = !DISubroutineType(types: !334)
!334 = !{!42, !38, !38, !38}
!335 = !DISubprogram(name: "graphNorm", linkageName: "\01?graphNorm@@YAMV?$vector@M$02@@0@Z", scope: !303, file: !303, line: 303, type: !248, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: false)
!336 = !DISubprogram(name: "graphNormalize", linkageName: "\01?graphNormalize@@YA?AV?$vector@M$02@@V1@0@Z", scope: !303, file: !303, line: 313, type: !232, isLocal: false, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false)
!337 = !DISubprogram(name: "coefCurvTensor", linkageName: "\01?coefCurvTensor@@YAMV?$vector@M$02@@HHHH@Z", scope: !303, file: !303, line: 323, type: !338, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: false)
!338 = !DISubroutineType(types: !339)
!339 = !{!42, !38, !37, !37, !37, !37}
!340 = !DISubprogram(name: "secCurv", linkageName: "\01?secCurv@@YAMV?$vector@M$02@@00@Z", scope: !303, file: !303, line: 339, type: !333, isLocal: false, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: false)
!341 = !DISubprogram(name: "scalarCurv", linkageName: "\01?scalarCurv@@YAMV?$vector@M$02@@@Z", scope: !303, file: !303, line: 362, type: !94, isLocal: false, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: false)
!342 = !DISubprogram(name: "yLine", linkageName: "\01?yLine@@YA?AV?$vector@M$02@@UgraphRay@@@Z", scope: !303, file: !303, line: 391, type: !343, isLocal: false, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false)
!343 = !DISubroutineType(types: !344)
!344 = !{!38, !325}
!345 = !DISubprogram(name: "evalGraphRay", linkageName: "\01?evalGraphRay@@YA?AUgraphRay@@U1@M@Z", scope: !303, file: !303, line: 421, type: !330, isLocal: false, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false)
!346 = !DISubprogram(name: "evalGraphRay", linkageName: "\01?evalGraphRay@@YAXAIAV?$vector@M$02@@0M@Z", scope: !303, file: !303, line: 441, type: !347, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: false)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !349, !349, !42}
!349 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38)
!351 = !DISubprogram(name: "CalculateDiffuseCoefficient", linkageName: "\01?CalculateDiffuseCoefficient@@YAMV?$vector@M$02@@00@Z", scope: !352, file: !352, line: 9, type: !333, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!352 = !DIFile(filename: "./Helpers.hlsli", directory: "")
!353 = !DISubprogram(name: "CalculateSpecularCoefficient", linkageName: "\01?CalculateSpecularCoefficient@@YA?AV?$vector@M$03@@V?$vector@M$02@@00M@Z", scope: !352, file: !352, line: 16, type: !354, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!354 = !DISubroutineType(types: !355)
!355 = !{!64, !38, !38, !38, !42}
!356 = !DISubprogram(name: "CalculatePhongLighting", linkageName: "\01?CalculatePhongLighting@@YA?AV?$vector@M$03@@V1@V?$vector@M$02@@_NMMM@Z", scope: !352, file: !352, line: 23, type: !357, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!357 = !DISubroutineType(types: !358)
!358 = !{!64, !64, !38, !107, !42, !42, !42}
!359 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URay@@IV1@@Z", scope: !352, file: !352, line: 61, type: !360, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false)
!360 = !DISubroutineType(types: !361)
!361 = !{!64, !120, !210, !64}
!362 = !DISubprogram(name: "TraceShadowRayAndReportIfHit", linkageName: "\01?TraceShadowRayAndReportIfHit@@YA_NURay@@I@Z", scope: !352, file: !352, line: 122, type: !363, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false)
!363 = !DISubroutineType(types: !364)
!364 = !{!107, !120, !210}
!365 = !DISubprogram(name: "GetRayInAABBPrimitiveLocalSpace", linkageName: "\01?GetRayInAABBPrimitiveLocalSpace@@YA?AURay@@XZ", scope: !352, file: !352, line: 196, type: !366, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false)
!366 = !DISubroutineType(types: !367)
!367 = !{!120}
!368 = !DISubprogram(name: "Raygen", linkageName: "\01?Raygen@@YAXXZ", scope: !1, file: !1, line: 56, type: !369, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?Raygen@@YAXXZ")
!369 = !DISubroutineType(types: !370)
!370 = !{null}
!371 = !DISubprogram(name: "traceRaySegment", linkageName: "\01?traceRaySegment@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 69, type: !372, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !374}
!374 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !376, line: 12, size: 256, align: 32, elements: !377)
!376 = !DIFile(filename: "./engine/Payloads.h", directory: "")
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !375, file: !376, line: 14, baseType: !184, size: 128, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "recursionDepth", scope: !375, file: !376, line: 15, baseType: !210, size: 32, align: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !375, file: !376, line: 16, baseType: !42, size: 32, align: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !375, file: !376, line: 17, baseType: !37, size: 32, align: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !375, file: !376, line: 18, baseType: !107, size: 32, align: 32, offset: 224)
!383 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 94, type: !372, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!384 = !DISubprogram(name: "Miss_Shadow", linkageName: "\01?Miss_Shadow@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 171, type: !385, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?Miss_Shadow@@YAXUShadowRayPayload@@@Z")
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387}
!387 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !376, line: 21, size: 64, align: 32, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !388, file: !376, line: 23, baseType: !42, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !388, file: !376, line: 24, baseType: !107, size: 32, align: 32, offset: 32)
!392 = !DISubprogram(name: "Intersection_Pacman", linkageName: "\01?Intersection_Pacman@@YAXXZ", scope: !393, file: !393, line: 5, type: !369, isLocal: false, isDefinition: true, scopeLine: 6, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?Intersection_Pacman@@YAXXZ")
!393 = !DIFile(filename: "./Pacman.hlsli", directory: "")
!394 = !DISubprogram(name: "ClosestHit_Pacman", linkageName: "\01?ClosestHit_Pacman@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z", scope: !393, file: !393, line: 33, type: !395, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.ProceduralPrimitiveAttributes*)* @"\01?ClosestHit_Pacman@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z")
!395 = !DISubroutineType(types: !396)
!396 = !{null, !374, !177}
!397 = !DISubprogram(name: "float3_ctor", linkageName: "\01?float3_ctor@@YA?AV?$vector@M$02@@M@Z", scope: !398, file: !398, line: 7, type: !399, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!398 = !DIFile(filename: "./JuliaSets.hlsli", directory: "")
!399 = !DISubroutineType(types: !400)
!400 = !{!38, !42}
!401 = !DISubprogram(name: "qSquare_float4", linkageName: "\01?qSquare_float4@@YA?AV?$vector@M$03@@V1@@Z", scope: !398, file: !398, line: 12, type: !402, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: false)
!402 = !DISubroutineType(types: !403)
!403 = !{!64, !64}
!404 = !DISubprogram(name: "qCube_float4", linkageName: "\01?qCube_float4@@YA?AV?$vector@M$03@@V1@@Z", scope: !398, file: !398, line: 16, type: !402, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!405 = !DISubprogram(name: "qLength2_float4", linkageName: "\01?qLength2_float4@@YAMV?$vector@M$03@@@Z", scope: !398, file: !398, line: 21, type: !406, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false)
!406 = !DISubroutineType(types: !407)
!407 = !{!42, !64}
!408 = !DISubprogram(name: "iSphere", linkageName: "\01?iSphere@@YA?AV?$vector@M$01@@V?$vector@M$02@@0M@Z", scope: !398, file: !398, line: 25, type: !409, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!409 = !DISubroutineType(types: !410)
!410 = !{!58, !38, !38, !42}
!411 = !DISubprogram(name: "setCamera", linkageName: "\01?setCamera@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@0M@Z", scope: !398, file: !398, line: 37, type: !412, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!412 = !DISubroutineType(types: !413)
!413 = !{!73, !38, !38, !42}
!414 = !DISubprogram(name: "jdist", linkageName: "\01?jdist@@YA?AV?$vector@M$01@@V?$vector@M$02@@V?$vector@M$03@@H@Z", scope: !398, file: !398, line: 48, type: !415, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!415 = !DISubroutineType(types: !416)
!416 = !{!58, !38, !64, !37}
!417 = !DISubprogram(name: "calcNormal", linkageName: "\01?calcNormal@@YA?AV?$vector@M$02@@V1@V?$vector@M$03@@H@Z", scope: !398, file: !398, line: 74, type: !418, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!418 = !DISubroutineType(types: !419)
!419 = !{!38, !38, !64, !37}
!420 = !DISubprogram(name: "raycast", linkageName: "\01?raycast@@YA?AV?$vector@M$01@@V?$vector@M$02@@0V?$vector@M$03@@MH@Z", scope: !398, file: !398, line: 85, type: !421, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false)
!421 = !DISubroutineType(types: !422)
!422 = !{!58, !38, !38, !64, !42, !37}
!423 = !DISubprogram(name: "colorSurface", linkageName: "\01?colorSurface@@YA?AV?$vector@M$02@@V1@V?$vector@M$01@@@Z", scope: !398, file: !398, line: 184, type: !424, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false)
!424 = !DISubroutineType(types: !425)
!425 = !{!38, !38, !58}
!426 = !DISubprogram(name: "JuliaDistance", linkageName: "\01?JuliaDistance@@YA_NV?$vector@M$02@@0AIAV1@AIAV?$vector@M$01@@M@Z", scope: !398, file: !398, line: 205, type: !427, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false)
!427 = !DISubroutineType(types: !428)
!428 = !{!107, !38, !38, !349, !133, !42}
!429 = !DISubprogram(name: "Intersection_Julia", linkageName: "\01?Intersection_Julia@@YAXXZ", scope: !398, file: !398, line: 251, type: !369, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?Intersection_Julia@@YAXXZ")
!430 = !DISubprogram(name: "ClosestHit_Julia", linkageName: "\01?ClosestHit_Julia@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z", scope: !398, file: !398, line: 279, type: !395, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.ProceduralPrimitiveAttributes*)* @"\01?ClosestHit_Julia@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z")
!431 = !DISubprogram(name: "mdist", linkageName: "\01?mdist@@YAMV?$vector@M$02@@AIAV?$vector@M$03@@@Z", scope: !432, file: !432, line: 4, type: !433, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!432 = !DIFile(filename: "./Mandelbulb.hlsli", directory: "")
!433 = !DISubroutineType(types: !434)
!434 = !{!42, !38, !435}
!435 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !64)
!437 = !DISubprogram(name: "calcNormal", linkageName: "\01?calcNormal@@YA?AV?$vector@M$02@@V1@M@Z", scope: !432, file: !432, line: 55, type: !438, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!438 = !DISubroutineType(types: !439)
!439 = !{!38, !38, !42}
!440 = !DISubprogram(name: "MandelbulbDistance", linkageName: "\01?MandelbulbDistance@@YA_NURay@@MHAIAMUProceduralPrimitiveAttributes@@M@Z", scope: !432, file: !432, line: 65, type: !441, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!441 = !DISubroutineType(types: !442)
!442 = !{!107, !120, !42, !37, !102, !176, !42}
!443 = !DISubprogram(name: "Intersection_Mandelbulb", linkageName: "\01?Intersection_Mandelbulb@@YAXXZ", scope: !432, file: !432, line: 120, type: !369, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?Intersection_Mandelbulb@@YAXXZ")
!444 = !DISubprogram(name: "ClosestHit_Mandelbulb", linkageName: "\01?ClosestHit_Mandelbulb@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z", scope: !432, file: !432, line: 146, type: !395, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.ProceduralPrimitiveAttributes*)* @"\01?ClosestHit_Mandelbulb@@YAXURayPayload@@UProceduralPrimitiveAttributes@@@Z")
!445 = !DISubprogram(name: "ClosestHit_Triangle", linkageName: "\01?ClosestHit_Triangle@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !446, file: !446, line: 5, type: !447, isLocal: false, isDefinition: true, scopeLine: 6, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit_Triangle@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!446 = !DIFile(filename: "./Triangles.hlsli", directory: "")
!447 = !DISubroutineType(types: !448)
!448 = !{null, !374, !449}
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 222, size: 64, align: 32, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !449, file: !1, line: 222, baseType: !59, size: 64, align: 32)
!452 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !90, file: !90, line: 103, type: !453, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false)
!453 = !DISubroutineType(types: !454)
!454 = !{!120, !28, !38, !135}
!455 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@IUByteAddressBuffer@@@Z", scope: !90, file: !90, line: 57, type: !456, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !211, !465}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 21, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 21, size: 96, align: 32, elements: !460, templateParams: !464)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !459, file: !1, line: 21, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !459, file: !1, line: 21, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !459, file: !1, line: 21, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!464 = !{!35, !47}
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 41, size: 32, align: 32, elements: !466)
!466 = !{}
!467 = !{!468, !470, !471, !473, !475, !476, !477, !478, !479, !481, !482, !485, !486, !487, !488, !489, !490, !492, !493, !495, !497, !498, !499, !500, !501, !502, !503, !504, !505, !507, !511, !512, !520, !530, !531, !533, !535, !537, !539, !540, !541, !542, !543, !545, !547, !549, !550, !551}
!468 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 128, type: !469, isLocal: true, isDefinition: true, variable: i32 16)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!470 = !DIGlobalVariable(name: "RAY_FLAG_CULL_FRONT_FACING_TRIANGLES", scope: !0, file: !1, line: 130, type: !469, isLocal: true, isDefinition: true, variable: i32 32)
!471 = !DIGlobalVariable(name: "N", scope: !186, file: !164, line: 121, type: !472, isLocal: true, isDefinition: true)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!473 = !DIGlobalVariable(name: "FLT_INFINITY", scope: !189, file: !164, line: 173, type: !474, isLocal: true, isDefinition: true)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!475 = !DIGlobalVariable(name: "eps", scope: !195, file: !164, line: 211, type: !474, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariable(name: "Threshold", scope: !224, file: !199, line: 209, type: !474, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariable(name: "k", scope: !261, file: !228, line: 170, type: !474, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariable(name: "threshold", scope: !284, file: !228, line: 357, type: !474, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariable(name: "MaxSteps", scope: !284, file: !228, line: 359, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!481 = !DIGlobalVariable(name: "InShadowRadiance", scope: !0, file: !4, line: 78, type: !474, isLocal: true, isDefinition: true, variable: float 0x3FD6666660000000)
!482 = !DIGlobalVariable(name: "GeometryStride", scope: !483, file: !4, line: 63, type: !480, isLocal: true, isDefinition: true, variable: i32 2)
!483 = !DINamespace(name: "HitGroup", scope: !484, file: !4, line: 57)
!484 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 54)
!485 = !DIGlobalVariable(name: "InstanceMask", scope: !484, file: !4, line: 56, type: !480, isLocal: true, isDefinition: true, variable: i32 -1)
!486 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 145, type: !469, isLocal: true, isDefinition: true, variable: i32 4)
!487 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 146, type: !469, isLocal: true, isDefinition: true, variable: i32 1)
!488 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 147, type: !469, isLocal: true, isDefinition: true, variable: i32 8)
!489 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !484, file: !4, line: 56, type: !480, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !483, file: !4, line: 58, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 64, align: 32, elements: !193)
!492 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !483, file: !4, line: 63, type: !480, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !494, file: !4, line: 66, type: !491, isLocal: true, isDefinition: true)
!494 = !DINamespace(name: "MissShader", scope: !484, file: !4, line: 65)
!495 = !DIGlobalVariable(name: "ChromiumReflectance", scope: !0, file: !4, line: 75, type: !496, isLocal: true, isDefinition: true)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!497 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !4, line: 77, type: !496, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariable(name: "InShadowRadiance", scope: !0, file: !4, line: 78, type: !474, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariable(name: "spread", scope: !0, file: !303, line: 6, type: !42, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariable(name: "amplitude", scope: !0, file: !303, line: 5, type: !42, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariable(name: "gaussianCenter", scope: !0, file: !303, line: 7, type: !38, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariable(name: "spread2", scope: !0, file: !303, line: 10, type: !42, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariable(name: "amplitude2", scope: !0, file: !303, line: 9, type: !42, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariable(name: "gaussianCenter2", scope: !0, file: !303, line: 11, type: !38, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 36, type: !506, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 36, size: 32, align: 32, elements: !466)
!507 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 37, type: !508, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!508 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 37, size: 128, align: 32, elements: !466, templateParams: !509)
!509 = !{!510}
!510 = !DITemplateTypeParameter(name: "element", type: !65)
!511 = !DIGlobalVariable(name: "g_indices", linkageName: "\01?g_indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 41, type: !465, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?g_indices@@3UByteAddressBuffer@@A")
!512 = !DIGlobalVariable(name: "g_vertices", linkageName: "\01?g_vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 42, type: !513, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?g_vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!513 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 42, size: 192, align: 32, elements: !466, templateParams: !514)
!514 = !{!515}
!515 = !DITemplateTypeParameter(name: "element", type: !516)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !4, line: 39, size: 192, align: 32, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !516, file: !4, line: 41, baseType: !181, size: 96, align: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !516, file: !4, line: 42, baseType: !181, size: 96, align: 32, offset: 96)
!520 = !DIGlobalVariable(name: "g_instanceBuffer", linkageName: "\01?g_instanceBuffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A", scope: !0, file: !1, line: 45, type: !521, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<InstanceBuffer>"* @"\01?g_instanceBuffer@@3V?$StructuredBuffer@UInstanceBuffer@@@@A")
!521 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceBuffer>", file: !1, line: 45, size: 1024, align: 32, elements: !466, templateParams: !522)
!522 = !{!523}
!523 = !DITemplateTypeParameter(name: "element", type: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceBuffer", file: !525, line: 46, size: 1024, align: 32, elements: !526)
!525 = !DIFile(filename: "./engine/RootComponents.h", directory: "")
!526 = !{!527, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "localSpaceToBottomLevelAS", scope: !524, file: !525, line: 48, baseType: !528, size: 512, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !182, line: 19, baseType: !135)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bottomLevelASToLocalSpace", scope: !524, file: !525, line: 49, baseType: !528, size: 512, align: 32, offset: 512)
!530 = !DIGlobalVariable(name: "gStep", scope: !0, file: !1, line: 26, type: !42, isLocal: true, isDefinition: true, variable: float* @gStep)
!531 = !DIGlobalVariable(name: "ChromiumReflectance.0", linkageName: "ChromiumReflectance.0", scope: !0, file: !4, line: 75, type: !532, isLocal: false, isDefinition: true)
!532 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !496, size: 32, align: 4)
!533 = !DIGlobalVariable(name: "ChromiumReflectance.1", linkageName: "ChromiumReflectance.1", scope: !0, file: !4, line: 75, type: !534, isLocal: false, isDefinition: true)
!534 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !496, size: 32, align: 4, offset: 32)
!535 = !DIGlobalVariable(name: "ChromiumReflectance.2", linkageName: "ChromiumReflectance.2", scope: !0, file: !4, line: 75, type: !536, isLocal: false, isDefinition: true)
!536 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !496, size: 32, align: 4, offset: 64)
!537 = !DIGlobalVariable(name: "ChromiumReflectance.3", linkageName: "ChromiumReflectance.3", scope: !0, file: !4, line: 75, type: !538, isLocal: false, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !496, size: 32, align: 4, offset: 96)
!539 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !4, line: 77, type: !532, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !4, line: 77, type: !534, isLocal: false, isDefinition: true)
!541 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !4, line: 77, type: !536, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !4, line: 77, type: !538, isLocal: false, isDefinition: true)
!543 = !DIGlobalVariable(name: "gaussianCenter.0", linkageName: "gaussianCenter.0", scope: !0, file: !303, line: 7, type: !544, isLocal: false, isDefinition: true)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "float3.0", file: !1, line: 28, baseType: !38, size: 32, align: 4)
!545 = !DIGlobalVariable(name: "gaussianCenter.1", linkageName: "gaussianCenter.1", scope: !0, file: !303, line: 7, type: !546, isLocal: false, isDefinition: true)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "float3.1", file: !1, line: 28, baseType: !38, size: 32, align: 4, offset: 32)
!547 = !DIGlobalVariable(name: "gaussianCenter.2", linkageName: "gaussianCenter.2", scope: !0, file: !303, line: 7, type: !548, isLocal: false, isDefinition: true)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "float3.2", file: !1, line: 28, baseType: !38, size: 32, align: 4, offset: 64)
!549 = !DIGlobalVariable(name: "gaussianCenter2.0", linkageName: "gaussianCenter2.0", scope: !0, file: !303, line: 11, type: !544, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariable(name: "gaussianCenter2.1", linkageName: "gaussianCenter2.1", scope: !0, file: !303, line: 11, type: !546, isLocal: false, isDefinition: true)
!551 = !DIGlobalVariable(name: "gaussianCenter2.2", linkageName: "gaussianCenter2.2", scope: !0, file: !303, line: 11, type: !548, isLocal: false, isDefinition: true)
!552 = !{i32 2, !"Dwarf Version", i32 4}
!553 = !{i32 2, !"Debug Info Version", i32 3}
!554 = !{!"dxc 1.2"}
!555 = !{!"Raytracing.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A//#define NONLINEAR_RAYTRACING\0D\0A#define RAYTRACING\0D\0A\0D\0A//#define SECTIONALCURVATURE\0D\0A\0D\0A#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22engine/ShaderCompat.h\22\0D\0A#include \22ProceduralPrimitivesLibrary.hlsli\22\0D\0A#include \22RaytracingShaderHelper.hlsli\22\0D\0A\0D\0A#include \22Graph3D.hlsli\22\0D\0A\0D\0Astatic float gStep = 4.;\0D\0Astatic float gMaxLenght = 600.;\0D\0A\0D\0A//***************************************************************************\0D\0A//*****------ Shader resources bound via root signatures -------*************\0D\0A//***************************************************************************\0D\0A\0D\0A// Scene wide resources.\0D\0A//  g_* - bound via a global root signature.\0D\0A//  l_* - bound via a local root signature.\0D\0ARaytracingAccelerationStructure g_scene : register(t0, space0);\0D\0ARWTexture2D<float4> g_renderTarget : register(u0);\0D\0AConstantBuffer<SceneConstantBuffer> g_sceneCB : register(b0);\0D\0A\0D\0A// Triangle resources\0D\0AByteAddressBuffer g_indices : register(t1, space0);\0D\0AStructuredBuffer<Vertex> g_vertices : register(t2, space0);\0D\0A\0D\0A// Procedural geometry resources\0D\0AStructuredBuffer<InstanceBuffer> g_instanceBuffer : register(t3, space0);\0D\0AConstantBuffer<PrimitiveConstantBuffer> l_materialCB : register(b1);\0D\0AConstantBuffer<PrimitiveInstanceConstantBuffer> l_aabbCB: register(b2);\0D\0A\0D\0A#include \22Helpers.hlsli\22\0D\0A\0D\0A//***************************************************************************\0D\0A//********************------ Ray gen shader.. -------************************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid Raygen()\0D\0A{\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    Ray ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.projectionToWorld);\0D\0A \0D\0A    // Cast a ray into the scene and retrieve a shaded color.\0D\0A    UINT currentRecursionDepth = 0;\0D\0A    float4 color = TraceRadianceRay(ray, currentRecursionDepth);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    g_renderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0Avoid traceRaySegment(inout RayPayload payload)\0D\0A{\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Direction = WorldRayDirection();\0D\0A    rayDesc.Origin = WorldRayOrigin() + (gStep - 0.000001) * rayDesc.Direction;\0D\0A    rayDesc.TMin = 0.f;\0D\0A    rayDesc.TMax = gStep;\0D\0A\0D\0A   //update the ray\0D\0A   //evalGraphRay(rayDesc.Origin, rayDesc.Direction, gStep-0.08); //Riemannian metric induced by a graph of a function\0D\0A    \0D\0A    TraceRay(g_scene,\0D\0A        RAY_FLAG_CULL_BACK_FACING_TRIANGLES,\0D\0A        TraceRayParameters::InstanceMask,\0D\0A        TraceRayParameters::HitGroup::Offset[RayType::Radiance],\0D\0A        TraceRayParameters::HitGroup::GeometryStride,\0D\0A        TraceRayParameters::MissShader::Offset[RayType::Radiance],\0D\0A        rayDesc, payload);\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//**********************------ Miss shaders -------**************************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload rayPayload)\0D\0A{\0D\0A#ifdef RAYTRACING    \0D\0A    float4 backgroundColor = float4(BackgroundColor);\0D\0A    rayPayload.color = backgroundColor;\0D\0A    rayPayload.hit = false;\0D\0A#endif    \0D\0A    \0D\0A#ifdef NONLINEAR_RAYTRACING  \0D\0A    rayPayload.dist += (gStep - 0.000001);\0D\0A    rayPayload.count += 1;\0D\0A   \0D\0A    if (rayPayload.dist < gMaxLenght)\0D\0A    {\0D\0A        //computing coefficients of the curvature tensor \0D\0A        float3 p = WorldRayOrigin() + (gStep - 0.000001) * WorldRayDirection();\0D\0A    \0D\0A        //float curvature = coefCurvTensor(p, 1, 2, 1, 2);\0D\0A        \0D\0A        //transfer function\0D\0A        float3 Csrc = float3(0.f,0.f,0.f);\0D\0A        \0D\0A        //scalar curvature\0D\0A        {\0D\0A            float curvature = scalarCurv(p);\0D\0A            \0D\0A            if (curvature < 0)\0D\0A            {\0D\0A                Csrc.x += -curvature * 10.;\0D\0A            }\0D\0A            else\0D\0A            {\0D\0A                Csrc.z += curvature * 10.;\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        //coefficient curvature tensor\0D\0A        //{\0D\0A        //    float curv1 = coefCurvTensor(p, 1, 2, 1, 2);\0D\0A        //    float curv2 = coefCurvTensor(p, 1, 2, 1, 3);\0D\0A        //    float curv3 = coefCurvTensor(p, 1, 2, 2, 3);\0D\0A        //    float curv4 = coefCurvTensor(p, 1, 3, 1, 3);\0D\0A        //    float curv5 = coefCurvTensor(p, 1, 3, 2, 3);\0D\0A        //    float curv6 = coefCurvTensor(p, 2, 3, 2, 3);\0D\0A            \0D\0A        //    float t = 1.f;\0D\0A            \0D\0A        //    rayPayload.color.x += curv1*t;//red\0D\0A        //    rayPayload.color.y += curv2*t;//green\0D\0A        //    rayPayload.color.z += curv3*t;//blue\0D\0A                                        \0D\0A        //    rayPayload.color.y += curv4*t;//cyan\0D\0A        //    rayPayload.color.z += curv4*t;//\0D\0A                                        \0D\0A        //    rayPayload.color.x += curv5*t;//magenta\0D\0A        //    rayPayload.color.z += curv5*t;//\0D\0A                                        \0D\0A        //    rayPayload.color.x += curv6*t;//yellow\0D\0A        //    rayPayload.color.y += curv6*t;//            \0D\0A        //}\0D\0A        \0D\0A        rayPayload.color += float4(Csrc,1);\0D\0A        \0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        float4 backgroundColor = float4(BackgroundColor);\0D\0A            \0D\0A        //float t = rayPayload.dist;\0D\0A        //rayPayload.color = lerp(rayPayload.color, BackgroundColor, 1.0 - exp(-0.0000002*t*t*t));\0D\0A        rayPayload.color += backgroundColor;\0D\0A    }\0D\0A    rayPayload.hit = false;\0D\0A#endif \0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss_Shadow(inout ShadowRayPayload rayPayload)\0D\0A{\0D\0A   rayPayload.dist += gStep;\0D\0A   rayPayload.hit = false;\0D\0A}\0D\0A\0D\0A#include \22Pacman.hlsli\22\0D\0A\0D\0A#include \22JuliaSets.hlsli\22\0D\0A\0D\0A#include \22Mandelbulb.hlsli\22\0D\0A\0D\0A#include \22Triangles.hlsli\22\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!556 = !{!"./AnalyticPrimitives.hlsli", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A//**********************************************************************************************\0D\0A//\0D\0A// AnalyticPrimitives.hlsli\0D\0A//\0D\0A// Set of ray vs analytic primitive intersection tests.\0D\0A//\0D\0A//**********************************************************************************************\0D\0A\0D\0A#ifndef ANALYTICPRIMITIVES_H\0D\0A#define ANALYTICPRIMITIVES_H\0D\0A\0D\0A\0D\0A#include \22RaytracingShaderHelper.hlsli\22\0D\0A\0D\0A// Solve a quadratic equation.\0D\0A// Ref: https://www.scratchapixel.com/lessons/3d-basic-rendering/minimal-ray-tracer-rendering-simple-shapes/ray-sphere-intersection\0D\0Abool SolveQuadraticEqn(float a, float b, float c, out float x0, out float x1)\0D\0A{\0D\0A    float discr = b * b - 4 * a * c;\0D\0A    if (discr < 0) return false;\0D\0A    else if (discr == 0) x0 = x1 = -0.5 * b / a;\0D\0A    else {\0D\0A        float q = (b > 0) ?\0D\0A            -0.5 * (b + sqrt(discr)) :\0D\0A            -0.5 * (b - sqrt(discr));\0D\0A        x0 = q / a;\0D\0A        x1 = c / q;\0D\0A    }\0D\0A    if (x0 > x1) swap(x0, x1);\0D\0A\0D\0A    return true;\0D\0A}\0D\0A\0D\0A// Calculate a normal for a hit point on a sphere.\0D\0Afloat3 CalculateNormalForARaySphereHit(in Ray ray, in float thit, float3 center)\0D\0A{\0D\0A    float3 hitPosition = ray.origin + thit * ray.direction;\0D\0A    return normalize(hitPosition - center);\0D\0A}\0D\0A\0D\0A// Analytic solution of an unbounded ray sphere intersection points.\0D\0A// Ref: https://www.scratchapixel.com/lessons/3d-basic-rendering/minimal-ray-tracer-rendering-simple-shapes/ray-sphere-intersection\0D\0Abool SolveRaySphereIntersectionEquation(in Ray ray, out float tmin, out float tmax, in float3 center, in float radius)\0D\0A{\0D\0A    float3 L = ray.origin - center;\0D\0A    float a = dot(ray.direction, ray.direction);\0D\0A    float b = 2 * dot(ray.direction, L);\0D\0A    float c = dot(L, L) - radius * radius;\0D\0A    return SolveQuadraticEqn(a, b, c, tmin, tmax);\0D\0A}\0D\0A\0D\0A// Test if a ray with RayFlags and segment <RayTMin(), RayTCurrent()> intersects a hollow sphere.\0D\0Abool RaySphereIntersectionTest(in Ray ray, out float thit, out float tmax, out ProceduralPrimitiveAttributes attr, in float3 center = float3(0, 0, 0), in float radius = 1)\0D\0A{\0D\0A    float t0, t1; // solutions for t if the ray intersects \0D\0A\0D\0A    if (!SolveRaySphereIntersectionEquation(ray, t0, t1, center, radius)) return false;\0D\0A    tmax = t1;\0D\0A\0D\0A    if (t0 < RayTMin())\0D\0A    {\0D\0A        // t0 is before RayTMin, let's use t1 instead .\0D\0A        if (t1 < RayTMin()) return false; // both t0 and t1 are before RayTMin\0D\0A\0D\0A        attr.normal = CalculateNormalForARaySphereHit(ray, t1, center);\0D\0A        if (IsAValidHit(ray, t1, attr.normal))\0D\0A        {\0D\0A            thit = t1;\0D\0A            return true;\0D\0A        }\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        attr.normal = CalculateNormalForARaySphereHit(ray, t0, center);\0D\0A        if (IsAValidHit(ray, t0, attr.normal))\0D\0A        {\0D\0A            thit = t0;\0D\0A            return true;\0D\0A        }\0D\0A\0D\0A        attr.normal = CalculateNormalForARaySphereHit(ray, t1, center);\0D\0A        if (IsAValidHit(ray, t1, attr.normal))\0D\0A        {\0D\0A            thit = t1;\0D\0A            return true;\0D\0A        }\0D\0A    }\0D\0A    return false;\0D\0A}\0D\0A\0D\0A// Test if a ray segment <RayTMin(), RayTCurrent()> intersects a solid sphere.\0D\0A// Limitation: this test does not take RayFlags into consideration and does not calculate a surface normal.\0D\0Abool RaySolidSphereIntersectionTest(in Ray ray, out float thit, out float tmax, in float3 center = float3(0, 0, 0), in float radius = 1)\0D\0A{\0D\0A    float t0, t1; // solutions for t if the ray intersects \0D\0A\0D\0A    if (!SolveRaySphereIntersectionEquation(ray, t0, t1, center, radius)) \0D\0A        return false;\0D\0A\0D\0A    // Since it's a solid sphere, clip intersection points to ray extents.\0D\0A    thit = max(t0, RayTMin());\0D\0A    tmax = min(t1, RayTCurrent());\0D\0A\0D\0A    return true;\0D\0A}\0D\0A\0D\0A// Test if a ray with RayFlags and segment <RayTMin(), RayTCurrent()> intersects multiple hollow spheres.\0D\0Abool RaySpheresIntersectionTest(in Ray ray, out float thit, out ProceduralPrimitiveAttributes attr)\0D\0A{\0D\0A    const int N = 3;\0D\0A    float3 centers[N] =\0D\0A    {\0D\0A        float3(-0.3, -0.3, -0.3),\0D\0A        float3(0.1, 0.1, 0.4),\0D\0A        float3(0.35, 0.35, 0.0)\0D\0A    };\0D\0A    float  radii[N] = { .6, 0.3, 0.15 };\0D\0A    \0D\0A    bool hitFound = false;\0D\0A\0D\0A    //\0D\0A    // Test for intersection against all spheres and take the closest hit.\0D\0A    //\0D\0A    thit = RayTCurrent();\0D\0A\0D\0A    // test against all spheres\0D\0A    for (int i = 0; i < N; i++)\0D\0A    {\0D\0A        float _thit;\0D\0A        float _tmax;\0D\0A        ProceduralPrimitiveAttributes _attr = { {0.f, 0.f, 0.f}, {0.f, 0.f, 0.f, 1.f} };\0D\0A        if (RaySphereIntersectionTest(ray, _thit, _tmax, _attr, centers[i], radii[i]))\0D\0A        {\0D\0A            if (_thit < thit)\0D\0A            {\0D\0A                thit = _thit;\0D\0A                attr = _attr;\0D\0A                hitFound = true;\0D\0A            }\0D\0A        }\0D\0A    }\0D\0A    return hitFound;\0D\0A}\0D\0A\0D\0A// Test if a ray segment <RayTMin(), RayTCurrent()> intersects an AABB.\0D\0A// Limitation: this test does not take RayFlags into consideration and does not calculate a surface normal.\0D\0A// Ref: https://www.scratchapixel.com/lessons/3d-basic-rendering/minimal-ray-tracer-rendering-simple-shapes/ray-box-intersection\0D\0Abool RayAABBIntersectionTest(Ray ray, float3 aabb[2], out float tmin, out float tmax)\0D\0A{\0D\0A    float3 tmin3, tmax3;\0D\0A    int3 sign3 = ray.direction > 0;\0D\0A\0D\0A    // Handle rays parallel to any x|y|z slabs of the AABB.\0D\0A    // If a ray is within the parallel slabs, \0D\0A    //  the tmin, tmax will get set to -inf and +inf\0D\0A    //  which will get ignored on tmin/tmax = max/min.\0D\0A    // If a ray is outside the parallel slabs, -inf/+inf will\0D\0A    //  make tmax > tmin fail (i.e. no intersection).\0D\0A    // TODO: handle cases where ray origin is within a slab \0D\0A    //  that a ray direction is parallel to. In that case\0D\0A    //  0 * INF => NaN\0D\0A    const float FLT_INFINITY = 1.#INF;\0D\0A    float3 invRayDirection = ray.direction != 0 \0D\0A                           ? 1 / ray.direction \0D\0A                           : (ray.direction > 0) ? FLT_INFINITY : -FLT_INFINITY;\0D\0A\0D\0A    tmin3.x = (aabb[1 - sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A    tmax3.x = (aabb[sign3.x].x - ray.origin.x) * invRayDirection.x;\0D\0A\0D\0A    tmin3.y = (aabb[1 - sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A    tmax3.y = (aabb[sign3.y].y - ray.origin.y) * invRayDirection.y;\0D\0A    \0D\0A    tmin3.z = (aabb[1 - sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A    tmax3.z = (aabb[sign3.z].z - ray.origin.z) * invRayDirection.z;\0D\0A    \0D\0A    tmin = max(max(tmin3.x, tmin3.y), tmin3.z);\0D\0A    tmax = min(min(tmax3.x, tmax3.y), tmax3.z);\0D\0A    \0D\0A    return tmax > tmin && tmax >= RayTMin() && tmin <= RayTCurrent();\0D\0A}\0D\0A\0D\0A// Test if a ray with RayFlags and segment <RayTMin(), RayTCurrent()> intersects a hollow AABB.\0D\0Abool RayAABBIntersectionTest(Ray ray, float3 aabb[2], out float thit, out ProceduralPrimitiveAttributes attr)\0D\0A{\0D\0A    float tmin, tmax;\0D\0A    if (RayAABBIntersectionTest(ray, aabb, tmin, tmax))\0D\0A    {\0D\0A        // Only consider intersections crossing the surface from the outside.\0D\0A        if (tmin < RayTMin() || tmin > RayTCurrent())\0D\0A            return false;\0D\0A\0D\0A        thit = tmin;\0D\0A\0D\0A        // Set a normal to the normal of a face the hit point lays on.\0D\0A        float3 hitPosition = ray.origin + thit * ray.direction;\0D\0A        float3 distanceToBounds[2] = {\0D\0A            abs(aabb[0] - hitPosition),\0D\0A            abs(aabb[1] - hitPosition)\0D\0A        };\0D\0A        const float eps = 0.0001;\0D\0A        if (distanceToBounds[0].x < eps) attr.normal = float3(-1, 0, 0);\0D\0A        else if (distanceToBounds[0].y < eps) attr.normal = float3(0, -1, 0);\0D\0A        else if (distanceToBounds[0].z < eps) attr.normal = float3(0, 0, -1);\0D\0A        else if (distanceToBounds[1].x < eps) attr.normal = float3(1, 0, 0);\0D\0A        else if (distanceToBounds[1].y < eps) attr.normal = float3(0, 1, 0);\0D\0A        else if (distanceToBounds[1].z < eps) attr.normal = float3(0, 0, 1);\0D\0A\0D\0A        return IsAValidHit(ray, thit, attr.normal);\0D\0A    }\0D\0A    return false;\0D\0A}\0D\0A\0D\0A#endif // ANALYTICPRIMITIVES_H"}
